      ******************************************************************
      * EXTRACT TRAILER OUT OF KCBDFOR                                 *
      ******************************************************************
      *      03  BDFO-FILE-TRAILER  REDEFINES  BDFO-FILE-HEADER.
        01  BDFO-FILE-TRAILER.
                 05  BDFO-FILE-TALLY   PIC  S9(9)      COMP-3.
                 05  BDFO-FILE-HASH    PIC  S9(9)      COMP-3.
                 05  BDFO-NUM-ACCOUNTS-SELECTED
                                       PIC  S9(9)      COMP-3.
      